[A Data Science Framework: To Achieve 99% Accuracy
](https://www.kaggle.com/code/ldfreeman3/a-data-science-framework-to-achieve-99-accuracy)

### How data scientist Beat the Odds
Its simple problem that perdicts the outcome of a binary event

In [2]:
import sys 
import pandas as pd 
import matplotlib 
import numpy as np 
import scipy as sp 
import IPython
from IPython import display
import sklearn 
# pip install -U scikit-learn
import random 
import time 
import warnings
warnings.filterwarnings('ignore')
from subprocess import check_output

In [6]:
#Common Model Algorithms
from sklearn import svm, tree, linear_model, neighbors, naive_bayes, ensemble, discriminant_analysis, gaussian_process
from xgboost import XGBClassifier

#Common Model Helpers
from sklearn.preprocessing import OneHotEncoder, LabelEncoder
from sklearn import feature_selection
from sklearn import model_selection
from sklearn import metrics

#Visualization
import matplotlib as mpl
import matplotlib.pyplot as plt
import matplotlib.pylab as pylab
import seaborn as sns
# replace the thing with the bottom script
# from pandas.tools.plotting import scatter_matrix
from pandas.plotting import scatter_matrix

#Configure Visualization Defaults
#%matplotlib inline = show plots in Jupyter Notebook browser
%matplotlib inline
mpl.style.use('ggplot')
sns.set_style('white')
pylab.rcParams['figure.figsize'] = 12,8

### Data science framework
1. Define the problem 
2. Gather the Data 
3. Prepare data Consumption 
4. Preform EDA
5. Model data 
6. Validate and Implement Data model 
7. Optimize and strategize

### 1. Define the problem 
RMS Titanic was sank

### 2. Gather the Data
All set

### 3. Perpare data Consumption

In [29]:
# Load data 
# Dataset needs to be broken into train, test, validation 
# 데이터셋은 학습, 테스트, 검증 데이터로 나누어져야합니다.
# In this example we'll split train data into train and test 
# 이번 예제에서는 train데이터를 학습, 테스트 데이터로 나눌 예정입니다

data_raw = pd.read_csv('data/titanic/train.csv')
data_val = pd.read_csv('data/titanic/test.csv')

# Make copy of data
data1 = data_raw.copy(deep=True)

# To clean both train and validation data at the same time, 
# we combine them both
data_cleaner = [data1, data_val]

# preview data 
print(data_raw.info())

# Preview 10 sample 
data_raw.sample(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
420,421,0,3,"Gheorgheff, Mr. Stanio",male,NaN,0,0,349254,7.8958,NaN,C
75,76,0,3,"Moen, Mr. Sigurd Hansen",male,25.0,0,0,348123,7.6500,F G73,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
659,660,0,1,"Newell, Mr. Arthur Webster",male,58.0,0,2,35273,113.2750,D48,C
569,570,1,3,"Jonsson, Mr. Carl",male,32.0,0,0,350417,7.8542,NaN,S
564,565,0,3,"Meanwell, Miss. (Marion Ogden)",female,NaN,0,0,SOTON/O.Q. 392087,8.0500,NaN,S
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.2500,NaN,S
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.0,1,2,SC/Paris 2123,41.5792,NaN,C
722,723,0,2,"Gillespie, Mr. William Henry",male,34.0,0,0,12233,13.0000,NaN,S
790,791,0,3,"Keane, Mr. Andrew ""Andy""",male,NaN,0,0,12460,7.7500,NaN,Q

After loading data we need following process 
(4 C's of data cleaning)
1. Correcting 
    * Looking at the data there's no aberrant or not acceptable data inputs
2. Completing 
    * There're null/missing values in
        * age 
        * cabin 
        * embarkerd
    * Null/missing values are bad for algorithms because they don't know how to handle them
3. Creating 
4. Converting

In [19]:
print('train columns with null values:\n', data1.isnull().sum())

train columns with null values:
 PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [20]:
print('Test/Validation columns with null values:\n', data_val.isnull().sum())

Test/Validation columns with null values:
 PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [22]:
data_raw.describe(include = 'all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

### Cleaning Data

In [30]:
# Completing
for dataset in data_cleaner:
    # Complete missing age with median
    # 중앙값을 사용하여 나이 결측치 채우기
    dataset['Age'].fillna(dataset['Age'].median(), inplace = True)

    # Complete embarked with mode 
    dataset['Embarked'].fillna(dataset['Embarked'].mode()[0], inplace = True)

    # Complete missing fare with median 
    dataset['Fare'].fillna(dataset['Fare'].median(), inplace = True)

# Delete the cabin feature/column and others previously stated to exclude in train dataset
drop_collumn = ['PassengerId','Cabin', 'Ticket']
data1.drop(drop_collumn, axis = 1, inplace = True)

print(data1.isnull().sum())

Survived    0
Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [31]:
print(data_val.isnull().sum())

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
dtype: int64